{
  "en": {
    "battery_powered": "Battery Powered",
    "battery_powered_text": "The unit will accept any 24V DC source, including a battery for portable operation.",
    "portable": "Portable",
    "portable_text": "Compact, weighing just 340g and battery-powered, it's the best option for field use.",
    "opensource": "Open Source",
    "opensource_text": "Most of the project including schematic and source code are licensed under CC-BY-NC-SA.",
    "overview": "Overview",
    "tech_details": "Technical Details",
    "dimensions": "Dimensions (WxHxD)",
    "weight": "Weight",
    "vcc": "Supply Voltage",
    "current_idle": "Current Consumption (Idle)",
    "current_full": "Current Consumption @ 100% DC",
    "soldering_range": "Soldering Temperature Range",
    "resolution": "Resolution",
    "mcu": "Main Controller",
    "display": "Display",
    "soldering_iron": "Soldering Iron",
    "power_connector": "Power Input Connector",
    "downloads_resources": "Downloads &amp; Resources",
    "options": "Options",
    "br_orders": "Brazilian Orders",
    "or_up_to": "Or up to",
    "of": "of",
    "no_interest": "no interest",
    "buy_pagseguro": "Purchase",
    "int_orders": "International Orders",
    "starting_at": "Base unit starting at",
    "complete_unit": "Complete unit:",
    "buy_tindie": "Buy on Tindie",
    "overview_text": "<p>This is not your \"jellybean\" soldering station that you might find practically everywhere on the internet and even at your local stores, this is the product of a necessity we had to be able to do on-site soldering. We work a lot on the field, doing repairs and installations which involves a lot of soldering, usually preparing high power connectors with a lot of thermal mass and making minor repairs on systems that might have a lot of soldered connections.</p><p>While doing this we encountered a few problems. First of all any good quality soldering station weighs a lot because of the big power transformer inside it, which makes carrying it on a work bag quite a chore, also since they are mains-powered and usually single voltage you have to rely on having an adequate wall outlet near you, which is not usually the case and you might have to use a long extension cord or even a autotransformer if your jobsite doesn’t have the correct voltage available.</p><img src=\"%web_root%/images/products/portastation/mainscreen.gif\" alt=\"Main screen animation\" align=\"left\" style=\"margin-right: 15px;\"><p>Because of the constant struggle we had to deal with and the fact that the “solutions” to the problem were in fact just remedying the symptoms not the cause, we decided it was time to build an actual portable soldering station that could easily be carried anywhere, weighing very little, having a small footprint, and able to be powered from a battery or a universal supply. This is when the PortaStation was born! Ticking every objective to become the solution to this problem, and not just that, but also able to be used at the bench on the lab as your main, every day, soldering station while still being easy to pack up and taken to the field. Weighing just 340g, powered from a 24V, 4A capable, power source, compatible with any Hakko 907 style soldering irons and sporting a beautiful graphic LCD, it is just a pleasure to work with.</p><p>With a minimalist and intuitive user interface it stays focused on the task at hand, giving you just the right amount of information being displayed at any given time, enabling you to monitor your power supply voltage in case you are running it from a battery and might risk damaging the cells if the voltage drops too low, while keeping a close eye on your soldering temperature and how the power is being applied to the heater of your soldering iron.</p><p>If you want to change the set temperature you can either dial it in by rotating the knob on the front of the unit to a specific value or you can set your most commonly used temperatures in the settings and easily cycle through them by pushing on the same knob, making your life a lot easier and making you more productive.</p><img src=\"%web_root%/images/products/portastation/menu.gif\" alt=\"Menu system animation\" align=\"right\" style=\"margin-left: 15px;\"><p>The unit comes with a very simple and comprehensive menu system, with clear labels indicating each function. In the settings you can configure your favorite working temperatures, so they are quickly accessible while soldering, change the unit used if you prefer Celsius, Fahrenheit or Kelvins (it’s ok, we won’t judge you), calibrate the unit if you feel like it’s out-of-spec, and a lot more settings that are coming with future firmware updates.</p><p>In summary the PortaStation is a very powerful soldering station built from the ground up in the 21st century with quality components, assembled and tested by our hands, packing a lot of functionality in a small footprint, weighing very little, and perfect for being used on the lab bench or taken to a jobsite.</p>"
  },
  "pt": {
    "battery_powered": "Bateria",
    "battery_powered_text": "A estação aceita qualquer fonte de 24V DC, incluindo uma bateria para uso em qualquer lugar que esteja.",
    "portable": "Portátil",
    "portable_text": "Compacto, pesando apenas 340g e funciona a bateria, é perfeito para levar consigo e soldar aonde estiver.",
    "opensource": "Open Source",
    "opensource_text": "Grande parte do projeto, incluindo o diagrama do circuito e o código fonte estão disponíveis sob a licença CC-BY-NC-SA.",
    "overview": "Visão Geral",
    "tech_details": "Especificações Técnicas",
    "dimensions": "Dimensões (LxAxP)",
    "weight": "Peso",
    "vcc": "Tensão de Entrada",
    "current_idle": "Consumo de Corrente (standby)",
    "current_full": "Consumo de Corrente @ 100% DC",
    "soldering_range": "Temperatura de Solda",
    "resolution": "Resolução",
    "mcu": "Controlador Principal",
    "display": "Display",
    "soldering_iron": "Ferro de Solda",
    "power_connector": "Conector de Entrada de Força",
    "downloads_resources": "Downloads e Documentação",
    "options": "Opções",
    "br_orders": "Brasil",
    "or_up_to": "Ou em até",
    "of": "de",
    "no_interest": "sem juros",
    "buy_pagseguro": "Comprar",
    "int_orders": "Outros Países",
    "starting_at": "A partir de",
    "complete_unit": "Versão completa:",
    "buy_tindie": "Comprar no Tindie",
    "overview_text": "<p>É com muita honra que apresentamos a nossa estação de solda portátil. Essa não é uma estação de solda comum como as que você consegue encontrar em um site da internet e até mesmo em lojas na sua cidade, este produto é o resultado de uma necessidade que tínhamos de que uma estação de solda não tivesse que ficar apenas em bancadas, mas também que pudesse ser levada conosco aonde precisássemos, que fosse prático. Muitas vezes precisamos realizar algum tipo de trabalho externo, algum reparo ou instalação, seja preparando conectores de alta potência com grande massa térmica ou mesmo, fazendo pequenos reparos em sistemas com muitas conexões soldadas.</p><img src=\"%web_root%/images/products/portastation/mainscreen.gif\" alt=\"Animação da tela principal\" align=\"left\" style=\"margin-right: 15px;\"><p>Devido a esses e outros problemas comumente encontrados por todos nós ao realizar trabalhos em campo junto ao fato das \"soluções\" apresentadas estarem apenas tentando mascarar os sintomas e não a causa dos problemas, decidimos construir nossa própria estação de solda do zero, pensando em primeiramente na portabilidade, de forma que a mesma fosse extremamente leve, pequena, e capaz de ser alimentada por qualquer fonte 24V, seja uma bateria ou uma fonte universal. Desta forma o PortaStation foi concebido, pesando apenas 340g, compatível com qualquer ferro de solda do padrão Hakko 907 e possuindo uma tela de LCD gráfica fazendo com que seja um prazer trabalhar com ele tanto na bancada quanto em campo.</p><p>Com uma interface minimalista e intuitiva o PortaStation faz com que você esteja sempre focado no trabalho a ser realizado, sem distrações e a todo momento apresentando apenas as informações cruciais para a tarefa. Caso você esteja utilizando uma bateria como fonte de alimentação a tensão de entrada é sempre indicada no canto superior da tela para que seja monitorada e indique ao operador o estado em que a mesma se encontra independentemente do tipo de bateria utilizado. Ao mesmo tempo lhe informa a temperatura selecionada juntamente com a atual da ponta do ferro e o quanto a estação está trabalhando para manter a temperatura desejada.</p><p>Caso queira mudar a temperatura basta girar o knob encontrado na parte frontal da base, como qualquer outra estação, até a temperatura especifica desejada, porém é muito comum que ao soldar se utilize alguns preferíveis valores de temperaturas, tendo isso em vista o PortaStation possui uma memória de temperaturas favoritas que podem ser configuradas no menu e que podem facilmente serem acessadas ao apertar o knob frontal, deixando o processo muito mais simples a aumentando, sua produtividade.</p><img src=\"%web_root%/images/products/portastation/menu.gif\" alt=\"Animação do menu de configurações\" align=\"right\" style=\"margin-left: 15px;\"><p>O PortaStation também vem com um simples, porém muito útil, sistema de menus que possibilita o usuário de fazer alterações nas configurações do aparelho como ajustar as temperaturas favoritas, trocar o sistema de unidades utilizado entre Celsius, Fahrenheit e Kelvin, calibrar o circuito de medição da temperatura caso você ache que o mesmo esteja precisando, e muitos outros recursos que ainda estão por vir nas próximas atualizações do sistema.</p><p>Resumindo, o PortaStation é uma estação de solda extremamente capaz de atender suas necessidades, feita do zero com tecnologias do século 21, com componentes de qualidade, construído e testado manualmente por nós, e com muito carinho, cheio de muitas funcionalidades que raramente são vistas e muitas vezes caras, sendo leve e pequeno, é absolutamente perfeito para ser utilizado na bancada como a sua estação de solda primária e quando necessário pode ser facilmente retirado e transportado para ser utilizado em qualquer lugar.</p>"
  }
}
